damBreak_turbulence/damBreak/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-10 230 0)
    (10 230 0)
    (10 220 0)
    (-10 220 0)
    (5 210 0)
    (-5 210 0)
    (5 200 0)
    (-5 200 0)
    (5 0 0)
    (-5 0 0)
    (50 200 0)
    (50 0 0)
    (-50 200 0)
    (-50 0 0)
    (-10 230 1)
    (10 230 1)
    (10 220 1)
    (-10 220 1)
    (5 210 1)
    (-5 210 1)
    (5 200 1)
    (-5 200 1)
    (5 0 1)
    (-5 0 1)
    (50 200 1)
    (50 0 1)
    (-50 200 1)
    (-50 0 1)
);
blocks
(
    hex (3 2 1 0 17 16 15 14) (10 5 1) simpleGrading (1 1 1)
    hex (5 4 2 3 19 18 16 17) (10 5 1) simpleGrading (1 1 1)
    hex (7 6 4 5 21 20 18 19) (10 5 1) simpleGrading (1 1 1)
    hex (9 8 6 7 23 22 20 21) (10 100 1) simpleGrading (1 1 1)
    hex (8 11 10 6 22 25 24 20) (40 100 1) simpleGrading (1 1 1)
    hex (13 9 7 12 27 23 21 26) (40 100 1) simpleGrading (1 1 1)
);

edges
(
);
patches
(
wall inlet
(
(0 1 15 14)
)
wall inletWall
(
(0 3 17 14)
(3 5 19 17)
(5 7 21 19)
(1 2 16 15)
(2 4 18 16)
(4 6 20 18)
)
wall bottleWall
(
(10 11 25 24)
(11 8 22 25)
(8 9 23 22)
(9 13 27 23)
(13 12 26 27)
)
patch atmosphere
(
(6 10 24 20)
(12 7 21 26)
)
empty frontAndBack
(
(0 1 2 3)
(3 2 4 5)
(4 6 7 5)
(6 10 11 8)
(6 8 9 7)
(7 9 13 12)
(14 15 16 17)
(17 16 18 19)
(19 18 20 21)
(20 24 25 22)
(20 22 23 21)
(21 23 27 26)
)
);




mergePatchPairs
(
);

// ************************************************************************* //
